In [2]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 782.2 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///stud_db;

In [5]:
%%sql
CREATE TABLE personal_details (
national_ID INTEGER(15) ,
stud_ID VARCHAR(15),
stud_name VARCHAR(100),
phone_number VARCHAR(15),
age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID)
);

 * sqlite:///stud_db;
Done.

[]

In [6]:
%%sql
INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud_db;
15 rows affected.

[]

In [7]:
%%sql
CREATE TABLE school_details(
stud_ID VARCHAR(15),
current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20),
residence VARCHAR(15),
stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

 * sqlite:///stud_db;
Done.

[]

In [8]:
%%sql
INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///stud_db;
15 rows affected.

[]

In [9]:
%%sql
UPDATE school_details
SET stud_email = (SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
                  FROM personal_details
                  WHERE school_details.stud_ID = personal_details.stud_ID);

 * sqlite:///stud_db;
15 rows affected.

[]

In [10]:
%%sql
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud_db;
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
CREATE TABLE contact_details (
stud_email VARCHAR(50) ,
phone_number VARCHAR(15),
next_of_kin_name VARCHAR(50),
next_of_kin_relation VARCHAR(10),
next_of_kin_contacts VARCHAR(13)
);

 * sqlite:///stud_db;
Done.

[]

In [12]:
%%sql
INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud_db;
15 rows affected.

[]

In [13]:
%%sql
UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///stud_db;
15 rows affected.

[]

In [14]:
%%sql
DROP TABLE contact_details_new;

 * sqlite:///stud_db;
(sqlite3.OperationalError) no such table: contact_details_new
[SQL: DROP TABLE contact_details_new;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [15]:
%%sql
CREATE TABLE contact_details_new (
stud_email VARCHAR(50) ,
phone_number VARCHAR(15),
next_of_kin_name VARCHAR(50),
next_of_kin_relation VARCHAR(10),
next_of_kin_contacts VARCHAR(13)
);

 * sqlite:///stud_db;
Done.

[]

In [16]:
%%sql
INSERT INTO contact_details_new (stud_email, phone_number,next_of_kin_relation , next_of_kin_contacts)
SELECT stud_email, phone_number,next_of_kin_relation , next_of_kin_contacts
FROM contact_details;

 * sqlite:///stud_db;
15 rows affected.

[]

In [17]:
%%sql
DROP TABLE contact_details;

 * sqlite:///stud_db;
Done.

[]

In [18]:
%%sql
ALTER TABLE contact_details_new RENAME TO contact_details;

 * sqlite:///stud_db;
Done.

[]

In [19]:
%%sql
CREATE TABLE financial_details (
stud_ID VARCHAR(15) ,
stud_name VARCHAR(50) ,
sem_fee INTEGER(6) ,
fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite:///stud_db;
Done.

[]

In [20]:
%%sql
INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///stud_db;
15 rows affected.

[]

In [21]:
%%sql
UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud_db;
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

a. Using JOIN get the student names, school id, email, phone number (new_stud_details)

CROSS JOINING WHERE TABLE 2 DOESNT HAVE A COMMON COLUMN WITH TABLE 1
SYNTAX BEING
FROM table1
CROSS JOIN table2
WHERE table1.columnX = table2.columnY;

In [22]:
%%sql
CREATE TABLE new_stud_details AS
SELECT
personal_details.stud_ID AS school_ID ,
personal_details.stud_name AS stud_name,
personal_details.phone_number AS phone_number,
school_details.stud_email AS email
FROM personal_details
CROSS JOIN school_details
WHERE personal_details.stud_ID = school_details.stud_email;

 * sqlite:///stud_db;
Done.

[]

b. Create a table with all the details from contacts to school and financial details (full_stud_details)

In [25]:
%%sql
CREATE TABLE full_stud_details AS
SELECT *
FROM school_details
LEFT JOIN financial_details ON school_details.stud_ID = financial_details.stud_ID
LEFT JOIN contact_details ON school_details.stud_email = contact_details.stud_email

UNION ALL

SELECT *
FROM financial_details
LEFT JOIN school_details ON financial_details.stud_ID= school_details.stud_ID
CROSS JOIN contact_details ON financial_details.stud_ID = contact_details.stud_email

UNION ALL

SELECT *
FROM contact_details
CROSS JOIN financial_details ON contact_details.stud_email= financial_details.stud_ID
LEFT JOIN school_details ON contact_details.stud_email = school_details.stud_email
;

 * sqlite:///stud_db;
Done.

[]

c. Add student names on any empty row of stud_name in financial_details

In [27]:
%%sql
UPDATE financial_details
SET stud_name = (
    SELECT personal_details.stud_name
    FROM personal_details
    WHERE financial_details.stud_ID = personal_details.stud_ID
)
WHERE stud_name IS NULL;

 * sqlite:///stud_db;
0 rows affected.

[]

d. On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)

In [34]:
%%sql
ALTER TABLE financial_details
ADD COLUMN fee_cleared BOOLEAN;

 * sqlite:///stud_db;
Done.

[]

In [37]:
%%sql
UPDATE financial_details
SET fee_cleared =
    CASE
        WHEN sem_fee <= fee_paid THEN true
        ELSE false
    END;

 * sqlite:///stud_db;
15 rows affected.

[]

In [41]:
%%sql
CREATE VIEW financial_details_view AS
SELECT pd.national_ID, fd.stud_name

FROM personal_details pd
JOIN financial_details fd ON pd.stud_ID = fd.stud_ID
WHERE fd.fee_cleared = 1;

 * sqlite:///stud_db;
Done.

[]

e. Get the national ID and name of all students who have cleared their fees (fee_cleared)

In [40]:
%%sql
SELECT pd.national_ID, fd.stud_name
FROM personal_details pd
JOIN financial_details fd ON pd.stud_ID = fd.stud_ID
WHERE fd.fee_cleared = 1;

 * sqlite:///stud_db;
Done.

[(344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (307243, 'Hedwig Tonks'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (321746, 'Career Mpya'),
 (390234, 'Deamon Anduro')]

f. Get the total sum of fees paid so far and the total current deficit (total_fee_balance)

In [42]:
%%sql
SELECT
    SUM(fee_paid) AS total_fees_paid,
    SUM(sem_fee) - SUM(fee_paid) AS total_current_deficit
FROM
    financial_details;

 * sqlite:///stud_db;
Done.

[(339600, 19330)]

g. Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties (home_county_count)

In [43]:
%%sql
SELECT current_home_county, COUNT(*) AS county_count
FROM school_details
GROUP BY current_home_county;

 * sqlite:///stud_db;
Done.

[('Kericho', 3),
 ('Kiambu', 2),
 ('Kisumu', 2),
 ('Nairobi', 2),
 ('Nakuru', 3),
 ('Nyamira', 1),
 ('Samburu', 2)]

h. Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.

In [44]:
%%sql
CREATE VIEW secondary_school_count AS
SELECT
    secondary_school_county,
    SUM(CASE WHEN gender = 'Male' THEN 1 ELSE 0 END) AS male_student_count,
    SUM(CASE WHEN gender = 'Female' THEN 1 ELSE 0 END) AS female_student_count
FROM school_deatils
GROUP BY secondary_school_county;

 * sqlite:///stud_db;
Done.

[]

i. Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage)

In [47]:
%%sql
SELECT
    mother_count,
    father_count,
    (mother_count * 100.0 / (mother_count + father_count)) AS mother_percentage,
    (father_count * 100.0 / (mother_count + father_count)) AS father_percentage
FROM (
    SELECT
        SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) AS mother_count,
        SUM(CASE WHEN next_of_kin_relation = 'Father' THEN 1 ELSE 0 END) AS father_count
    FROM
        contact_details
);

 * sqlite:///stud_db;
Done.

[(7, 8, 46.666666666666664, 53.333333333333336)]